import { useAtom } from "jotai";
import { modalDisplayAtom } from "../store";
import { useDisableBodyScroll } from "../utils/useDisableBodyScroll";
import AccessibilityStatement from "./AccessibilityStatement";
import TermsOfUse from "./TermsOfUse";

const TermsOfUseModal = () => {
  const [isModalOpen, setIsModalOpen] = useAtom(modalDisplayAtom);
  const handleClose = () => setIsModalOpen("none");

  useDisableBodyScroll(isModalOpen);

  return (
    <>
      {isModalOpen !== "none" && (
        <div className="flex justify-center items-center overflow-x-hidden overflow-y-auto fixed inset-0 z-50 outline-none focus:outline-none text-black">
          <div className="bg-black opacity-70 md:opacity-50 fixed h-screen w-screen overflow-hidden pointer-events-none" />
          <div className="bg-white z-50 max-w-3xl overflow-hidden relative mx-4 my-6 max-h-[calc(100vh-4rem)]">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              fill="none"
              viewBox="0 0 24 24"
              stroke="currentColor"
              className="h-10 w-10 cursor-pointer absolute top-4 left-6"
              onClick={handleClose}
            >
              <path
                strokeLinecap="round"
                strokeLinejoin="round"
                strokeWidth="2"
                d="M6 18L18 6M6 6l12 12"
              />
            </svg>
            <div className="overflow-y-auto max-h-[calc(100vh-4rem)] px-8 py-4 md:px-20 md:py-12  scrollbar-thumb-themeStepperGrey scrollbar-track-transparent scrollbar-thin border-2 ml-1">
              {/* <h3 className="text-5xl font-bold mb-8">תנאי השימוש</h3>
              <div className="text-base md:text-xl font-medium">
                <h4 className="underline font-extrabold my-4">כללי</h4>
                <span className={listNumberStyles}>1 . </span> רשת מרפאות סאן –
                Sun Clinic ו/או מי מטעמה המוסמך לכך (להלן: ” Sun Clinic “)
                מפעילה אתר אינטרנט זה (להלן: “האתר“) אשר מציע למשתמשים בו
                (כהגדרתם להלן) מידע בתחומים שונים הנוגעים לתחומי פעילותה של Sun
                Clinic והשירותים שהיא מעניקה.
                <br />
                <span className={listNumberStyles}>2 . </span>
                השימוש באתר ובכל המדורים המשולבים בו לרבות קבלת מידע ושירותים מ-
                Sun Clinic באמצעות האתר, כפוף לתנאי השימוש המפורטים להלן (להלן:
                “תנאי השימוש” או “ההסכם“). אנא קרא/י את תנאי השימוש בקפידה.
                כניסתך לאתר ועשיית שימוש בו ו/או בשירותים שהוא מציע ייחשבו
                כהסכמתך לתנאים אלה.
                <br />
                <span className={listNumberStyles}>3 . </span>
                תנאי השימוש באתר מנוסחים בלשון זכר מטעמי נוחות בלבד והם מתייחסים
                לגברים ולנשים כאחד.
                <br />
                <span className={listNumberStyles}>4 . </span>
                בהסכם זה, תהיה לכל אחד מהמונחים הבאים המשמעות המופיעה לצידו:
                <br />
                <span className={subListStyles}>4.1 . </span>
                “מידע” – כל מידע המוצג באתר , לרבות מידע רפואי כלשהו (בין אם
                בנוגע למטופל ספציפי ובין בכלל), מידע טקסטואלי, תכנים, עדכונים,
                מאמרים, תיעוד, תוכניות, שרטוטים, פרטים, עובדות, חומרים, מסמכים,
                נהלים, סקיצות, תוכנות, כיתוב, סימנים, סמלים וסמלילים, תוים,
                קבצים, טקסטים, מידע ויזואלי (לרבות תמונות וסרטונים), כתובות,
                קודי מחשב, קבצים וכיו”ב.
                <br />
                <span className={subListStyles}>4.2 . </span> “משתמש” – כל אדם
                ו/או ישות אשר נכנס לאתר ו/או גולש בו, וזאת בין אם השימוש הינו
                קבוע או מזדמן.
                <br />
                <h4 className="underline font-extrabold my-4">
                  השימוש באתר ובמידע
                </h4>
                <span className={listNumberStyles}>5 . </span>
                המשתמש מתחייב להשתמש באתר בתום לב ובהתאם להוראות תנאי שימוש אלה.
                מבלי לגרוע מהאמור, השימוש ייעשה בכפוף לכל דין ובהתאם להנחיות Sun
                Clinic ו/או מי מטעמה, והמשתמש מצהיר בזאת ומתחייב בכניסתו לאתר כי
                הוא יימנע מכל פגיעה שהיא בSun Clinic ו/או בצדדים שלישיים כלשהם
                באמצעות השימוש באתר. השימוש באתר מהווה הסכמה וקבלת תנאי הסכם זה.
                משתמש שאינו מסכים לתנאי השימוש (חלקם או כולם) המנוסחים בהסכם זה,
                אינו רשאי לעשות שימוש כלשהו באתר או בחלק ממנו. מובהר בזאת, כי
                תנאי הסכם זה פועלים במקביל ובכפוף לתנאי השימוש של צדדים שלישיים,
                ככל שיהיו כאלה, והם באים להוסיף עליהם.
                <br />
                <span className={listNumberStyles}>6 . </span>
                מבלי לגרוע מהאמור לעיל, מתחייב המשתמש כי הוא לא יגרום ו/או
                יתרום, בין בהתנהגות, בין במעשה ובין במחדל (במישרין ו/או בעקיפין)
                לנזק כלשהו ל- Sun Clinic ו/או לצדדים שלישיים, וכי בעשותו שימוש
                באתר הוא לא יפר כל זכות של Sun Clinic ו/או צד שלישי כאמור, לרבות
                זכויות חוזיות, קנייניות, זכויות יוצרים, זכויות מוסריות, זכויות
                מעין קנייניות, חובות אמון, סודיות רפואית, סודות מסחריים, סימני
                מסחר, פטנטים, הוצאת לשון הרע, פגיעה בפרטיות וביצוע פרסומים
                אסורים על פי דין.
                <br />
                <span className={listNumberStyles}>7 . </span>
                המשתמש מתחייב, שלא לעשות שימוש לרעה באתר זה ולא לנקוט בפעולות
                שיש בהן כדי לפגוע בSun Clinic ו/או במשתמשים אחרים באמצעות האתר.
                מבלי לגרוע מכלליות האמור לעיל, מתחייב המשתמש שלא לנקוט בפעולות
                הבאות: משלוח דואר זבל, מכתבי שרשרת, משחקי פירמידה, מסירת סיסמאות
                ו/או פרטים אישיים ו/או אינטימיים אודות משתמשים אחרים ו/או הטרדת
                משתמשים, עשיית פרסום ו/או קידום מכירות מסחריים, תעמולה פוליטית
                ו/או קידום מתמודדים ומפלגות בבחירות, שימוש בשפה בוטה ו/או
                פוגענית, העלאת תכנים ו/או קישורים כלשהם לתכנים אשר יש בהם כדי
                לפגוע ברגשות משתמשים אחרים ו/או יש בהם לגרום נזק, השתתפות ו/או
                הפניה לשיתוף קבצים אסור ו/או לאתר המפר זכויות של צדדים שלישיים,
                חבלה מכל סוג שהוא באתר, וכן כל נסיון להעלות ו/או למסור מידע ו/או
                להציע שירותים שהמשתמשים ו/או Sun Clinic אינם מעוניינים בהם.
                <br />
                <span className={listNumberStyles}>8 . </span>
                המשתמש מתחייב שלא לעשות שינויים ו/או להתערב בצורה כלשהי בקוד
                המקור של האתר ו/או המידע ולא להעלות תוכנות ו/או יישומים כלשהם
                שעלולים לפגוע או לגרום נזק לSun Clinic ו/או לצדדים שלישיים אחרים
                כלשהם. בין היתר, המשתמש מתחייב להימנע מביצוע הפעולות הבאות ביחס
                לאתר:
                <br />
                <span className={subListStyles}>8.1 . </span> גלישה, סריקה או
                שימוש באתר באמצעות תוכנות מחשב המיועדות לאסוף מידע, או לבצע
                פעולות בדרך של חיקוי גולש רגיל, לרבות Bots או Crawlers וכדומה.
                <br />
                <span className={subListStyles}>8.2 . </span> מניפולציה על כתובת
                ה-URL של דפים פנימיים, בכדי להגיע לדפים פנימיים אליהם אין לו
                גישה ישירה (URL Hacking).
                <br />
                <span className={subListStyles}>8.3 . </span> העלאה או העברה של
                תוכן, או ביצוע פעולות, אשר יש בהן משום עבירה על חוקי מדינת ישראל
                או בכלל; ובכלל זאת להימנע מהעלאה, העברה או פרסום של תוכן אשר יש
                בו כדי להפר זכות יוצרים, סימן מסחר או סוד מסחרי של אחר, פרסום
                לשון הרע, דברי תועבה או פגיעה בפרטיותו של אחר.
                <br />
                <span className={subListStyles}>8.4 . </span>ביצוע פעולה בעיצוב
                האתר, קוד המקור, אלמנטים או תכנים המופיעים באתר, אשר הזכות לבצעה
                נתונה בלעדית, על פי חוק זכות יוצרים התשס”ח-2007, לבעל זכות
                היוצרים, שלא בהתאם לאמור בהסכם זה.
                <br />
                <span className={listNumberStyles}>9 . </span>
                הזכות לעשות שימוש במידע נתונה לשימושו האישי והפרטי בלבד של
                המשתמש. אין לעשות כל שימוש מסחרי במידע ו/או למטרות רווח כלשהן
                והמשתמש אינו רשאי להרשות שימוש כלשהו במידע כאמור לצדדים שלישיים
                כלשהם, בין בתמורה ובין שלא בתמורה. מובהר, כי אין לעשות שימוש
                במידע כלשהו המתפרסם באתר לצורך הצגתו ברשת האינטרנט ו/או בשירות
                אחר כלשהו, מבלי לקבל את הסכמתה של Sun Clinic לכך בכתב ומראש
                ובכפוף לתנאי ההסכמה כאמור, אם וככל שתינתן. המשתמש מתחייב, כי הוא
                לא יאגור מידע באמצעות תוכנות מסוגים שונים או יפיץ מידע שפורסם
                באתר ברבים באופן מסחרי או במסגרת מסחרית או לכל מטרה אחרת. אין
                להציג את האתר בעיצוב או מימשק גרפי שונים מאלה שנקבעו על ידי Sun
                Clinic, אלא בכפוף לקבלת הסכמתה לכך מראש ובכתב ואין להציג את האתר
                באופן הגורע בצורה כלשהי מן התכנים המצויים בו.
                <br />
                <span className={listNumberStyles}>10 . </span>
                המשתמש מתחייב לשמור בקפדנות על המידע ולנקוט בכל אמצעי הזהירות
                הנדרשים לשם מניעת אובדנו ו/או הגעתו לידי אחר.
                <br />
                <span className={listNumberStyles}>11 . </span>
                המשתמש מתחייב, ליידע את Sun Clinic, באופן מיידי, על כל חשש
                לפגיעה במשתמשים ו/או בצדדים שלישיים ו/או הפרה קיימת או צפויה של
                הוראות הדין ו/או תנאי שימוש אלה הנובעים בקשר עם פעולות המשתמש.
                <br />
                <span className={listNumberStyles}>12 . </span>
                המשתמש מצהיר בזאת ומאשר, כי ידוע לו והוא מסכים לכך ש- Sun Clinic
                תהא רשאית לנקוט בכל האמצעים העומדים לרשותה על פי דין כנגד משתמש
                שהפר את תנאי השימוש כאמור, לרבות העברת פרטיו לצדדים שלישיים. בין
                היתר, Sun Clinic שומרת לעצמה את הזכות:
                <br />
                <span className={subListStyles}>12.1 . </span> להפסיק או למנוע
                את השימוש באתר, או חלקים ממנו, ממשתמש אשר הפר סעיף מסעיפי הסכם
                זה, או בכלל; הכל על פי שיקול דעתה הבלעדי של Sun Clinic, ומבלי
                שתהיה חייבת להודיע על כך מראש למשתמש. לא תישמע כל טענה של המשתמש
                בעניין זה.
                <br />
                <span className={subListStyles}>12.2 . </span> להסיר כל תוכן או
                לבטל כל פעולה אשר בוצעה על-ידי המשתמש ואשר יש בה משום הפרת סעיף
                מסעיפי הסכם זה, או בכלל.
                <br />
                <span className={subListStyles}>12.3 . </span> Sun Clinic תהיה
                רשאית לחסום גישה לאתר – מכתובות או מאתרים אשר לא אושרו על- ידי
                Sun Clinic לשימוש במוצריה (בכתב ומראש), או שעלולים לגרום נזק ל-
                Sun Clinic או מוצריה – הכל לפי שיקול דעתה הבלעדי של Sun Clinic
                וללא צורך בהודעה מוקדמת.
                <br />
                <h4 className="underline font-extrabold my-4">פרטי המשתמש</h4>
                <span className={listNumberStyles}>13 . </span>
                המשתמש אינו חייב למסור פרטים כלשהם לSun Clinic ומסירתם תיעשה
                בהתאם לרצון המשתמש בלבד.
                <br />
                <span className={listNumberStyles}>14 . </span>
                הפרטים שיימסרו על ידי המשתמש ומידע נוסף שיצטבר אודותיו יישמרו
                במאגר המידע של Sun Clinic. המשתמש מסכים ומאשר ו- Sun Clinic
                מתחייבת, כי היא תעשה בנתונים שיצטברו אצלה שימוש הוגן, סביר
                ובהתאם להוראות כל דין. בכפוף להוראות הדין, מסכים המשתמש כי בין
                היתר, Sun Clinic תשתמש במידע שיצטבר אודותיו לצורך פרסום, שיווק
                וקידום מכירות, הפקת פעילויות ואירועים, מתן שירותי דיוור (על ידי
                Sun Clinic ו/או מי מטעמה ו/או גורמים אחרים), אחסון, קיום מטרות
                סטטיסטיות ו/או לצורך עשיית עסקאות מכל סוג עם לקוחות וצדדים
                שלישיים וכן שימוש לצרכים מסחריים ואחרים.
                <br />
                המשתמש מאשר ל-Sun Clinic לשלוח לתיבת הדוא”ל שלו, לפי הפרטים שמסר
                המשתמש, עדכונים ואישורים ביחס לפעולות המשתמש באתר, וכל הודעה
                אחרת, לרבות מהדורות דואר אלקטרוני של תכני האתר (newsletter) או
                פרסומות.
                <br />
                <span className={listNumberStyles}>15 . </span>
                המשתמש מסכים כי בכפוף לדין, Sun Clinic תהיה רשאית להגביל או
                לחסום את המידע (כולו או חלקו) בפני משתמש, באופן זמני או קבוע,
                במידה והמשתמש השתמש במידע בניגוד לדרישות כל דין ו/או בניגוד
                להוראות תנאי השימוש או מכל סיבה סבירה אחרת. Sun Clinic תהא רשאית
                למסור את פרטיו האישיים של המשתמש לרשויות מוסמכות או לצדדים
                שלישיים, במידה ועל פי שיקול דעתה, הנסיבות מצריכות זאת.
                <br />
                <span className={subListStyles}>15.1 . </span> נוסף על האמור
                לעיל, Sun Clinic שומרת לעצמה את הזכות לקבוע, כי גישה לשירותים
                מסוימים תתאפשר רק למשתמש אשר נרשם לאתר, ומסר פרטים מסוימים, אשר
                ייקבעו על-ידי Sun Clinic (להלן: “חשבון משתמש” או “החשבון“).
                <br />
                ההוראות הבאות יחולו על יצירת חשבון משתמש:
                <br />
                <ul className="list-disc">
                  <li>
                    חלה חובה למסור את מלוא הפרטים הנדרשים בעת פתיחת חשבון.
                  </li>
                  <li>
                    {" "}
                    אסור ליצור חשבון משתמש המכיל נתונים אשר אינם פרטיו האמתיים
                    והמלאים של פותח החשבון.
                  </li>
                  <li>אסור ליצור חשבון עבור אדם אשר אינו נוכח מול צג המחשב בעת ההרשמה
                או אשר אינו מאשר את תנאי הסכם זה.</li>
                </ul>
                לעניין הוראות אלו יודגש כי התחזות היא עבירה פלילית.
                <br />
                <span className={subListStyles}>15.2 . </span> מובהר בזאת, כי על אף ש-Sun Clinic נוקטת באמצעים לאבטחת תוכן
                חשבון המשתמש, היא אינה יכולה להבטיח בצורה מוחלטת את אי חשיפתו
                כתוצאה מחדירה לא מורשית, ולמשתמש לא תהיה כל טענה כלפי החברה בגין
                נזקים, אשר ייגרמו כתוצאה מחדירה לא מורשית לחשבון המשתמש.
                <br />
                <span className={listNumberStyles}>16 . </span>
                אחריות המידע והשירותים באתר מוצעים למשתמשים במצב כמות שהם (AS
                IS) והמשתמש מסכים ומאשר, כי Sun Clinic, לרבות נציגיה, עובדיה,
                מנהליה, בעלי מניותיה והפועלים מטעמה, לא תהיה אחראית לכל נזק שהוא
                (ישיר ו/או עקיף) שנגרם למשתמש ו/או צד שלישי כלשהו בקשר עם השימוש
                שהמשתמש עשה, בין במישרין בין בעקיפין, במידע ו/או להסתמכות המשתמש
                עליו.
                <br />
                <span className={listNumberStyles}>17 . </span>
                המשתמש מסכים ומאשר, כי לא תהיה לו כל טענה, דרישה ו/או תביעה כלפי
                Sun Clinic ו/או מי מטעמה בגין כל נזק (ישיר ו/או עקיף) ובכלל,
                בקשר עם המידע והשירותים המוצעים באתר או באמצעותו, דיוקם,
                מהימנותם, שלמותם, עדכניותם או תדירות פרסומם. השימוש וההסתמכות על
                המידע באתר ייעשה על אחריותו הבלעדית והמלאה של המשתמש.
                <br />
                <span className={listNumberStyles}>18 . </span>
                מובהר, כי Sun Clinic ו/או ספקי מידע כלשהם מטעמה לרבות עובדיהם
                ו/או נציגיהם ו/או מי שפועל מטעמם, לא יהיו והם אינם אחראים בשום
                אופן להתאמת האתר, לרבות המידע לצרכי ו/או למטרות המשתמש.
                <br />
                <span className={listNumberStyles}>19 . </span>
                המשתמש מסכים, כי לגבי כל עניין העולה בקשר עם השימוש באתר,
                באחריותו המלאה של המשתמש לערוך בדיקות נוספות ולקבל יעוץ מקצועי
                מתאים, במידה שהנסיבות מצריכות זאת. מוסכם בזאת, כי אין באמור
                בפרסומים מקצועיים כלשהם המפורסמים באתר כדי להוות ייעוץ ו/או מתן
                חוות דעת בעניין ואין באמור באתר משום תחליף לקבלת חוות דעת אישית
                מקצועית ומסודרת מגורם מוסמך שיבחן את כל הנתונים האישיים
                הרלוונטיים של המשתמש.
                <br />
                <span className={listNumberStyles}>20 . </span>
                Sun Clinic נוקטת באמצעים סבירים המקובלים בתעשיה על מנת לאפשר
                שהמידע שבאתר יהיה נכון ומדויק ככל שניתן, אולם על אף האמור ייתכן
                ויחול ליקוי ו/או טעות ו/או אי דיוק במידע ו/או בדרך העברתו אל
                המשתמש, והמשתמש מצהיר בזאת כי הדבר ידוע לו והוא פוטר בזאת את Sun
                Clinic ו/או ספקי המידע מטעמה מכל אחריות ו/או חבות ביחס לכך.
                <br />
                <span className={listNumberStyles}>21 . </span>
                Sun Clinic אינה מתחייבת, כי האתר יהא זמין בכל עת וכי פעולת ו/או
                שלמות האתר לא יופרעו ו/או יתנהלו בלא הפסקות ו/או בלא טעויות,
                קלקולים, תקלות או כשלים. Sun Clinic לא תהיה אחראית להפרעות כאמור
                לעיל, והיא לא תהיה אחראית לאי התאמות למשתמש בטיב, אופי והיקף
                המידע (לרבות דרך העברתו), לאובדן, הפסד או נזק ישיר, עקיף תוצאתי
                או אחר, שיגרמו למשתמש או לצד ג’ כלשהו בקשר עם הפרעות כאמור ו/או
                בקשר עם הפסקת שירותים מסוימים באתר, מכל סיבה שהיא.<br />
                <span className={listNumberStyles}>22 . </span>
                Sun Clinic לא
                תשא בכל אחריות לחשיפת פרטים שנמסרו על ידי משתמש לאתר במקרה של
                חדירה שלא כדין למערכות המחשב של האתר.
                <br />
                <span className={listNumberStyles}>23 . </span>
                מובהר עוד, כי Sun Clinic לא תשא באחריות לתוכנם של אתרים המקושרים
                מהאתר, אם וככל שיהיו כאלה. בכלל זה Sun Clinic לא תשא באחריות
                למידע המתפרסם באתרים הנ”ל לרבות שלמותו, דיוקו, עדכניותו ונכונותו
                או כל פרט אחר הקשור עמו. Sun Clinic לא תהיה אחראית לכל נזק ישיר
                או עקיף, כספי או אחר, שייגרם כתוצאה משימוש או הסתמכות על אתרים
                אלה.
                <br />
                <span className={listNumberStyles}>24 . </span>
                Sun Clinic רשאית לכלול באתר תכנים מסחריים מכל מין וסוג ולפי
                שיקול דעתה הבלעדי, לרבות פרסומות, באנרים, ומודעות ולרבות מודעות
                מסחריות של צדדים שלישיים. המשתמש משחרר בזאת ופוטר את Sun Clinic
                מכל אחריות ו/או חבות הקשורה ו/או המתייחסת לתכנים מסחריים כלשהם
                המוצגים באתר ושאינם נעשים מטעמה של Sun Clinic.
                <br />
                <span className={listNumberStyles}>25 . </span>
                המשתמש מסכים ומאשר, כי Sun Clinic רשאית לפי שיקול דעתה למנוע
                ממשתמש את השימוש באתר, למנוע גישה לאתר (כולו או חלקו), לעדכן,
                לשנות ו/או למחוק מעת לעת את המידע המופיע באתר (כולו או חלקו),
                לשנות מעת לעת את מבנה אתר, מראה האתר, היקפם וזמינותם של השירותים
                הניתנים בו וכל היבט אחר הכרוך בהם וזאת בלא צורך להודיע למשתמש על
                כך מראש וללא צורך לקבל את הסכמתו לכך. המשתמש מסכים, כי במקרה
                כזה, Sun Clinic לא תהיה אחראית לכל נזק, מכל מין וסוג, שייגרם
                למשתמש ו/או לצד שלישי כלשהו.
                <br />
                <h4 className="underline font-extrabold my-4">קניין רוחני</h4>
                <span className={listNumberStyles}>26 . </span>
                המשתמש מסכים, כי כל זכויות הקניין באתר ובמידע שבו לרבות זכויות
                הקניין הרוחני, זכויות יוצרים, סודות מסחריים, זכויות בתוכנה,
                בפטנטים, בהפצה ובהמצאות הינם ויהיו תמיד בבעלותה הבלעדית והמלאה
                של Sun Clinic ואין למשתמש כל זכות מכל סוג שהוא באתר ובמידע שבו.
                <br />
                <span className={listNumberStyles}>27 . </span>
                המשתמש מתחייב, כי הוא לא יעתיק, יפיץ, יציג בפומבי, יתרגם ו/או
                ימסור לצד שלישי כלשהו כל חלק, מוצר ו/או פלט של המידע שבאתר מבלי
                לקבל את הסכמתה המפורשת לכך של Sun Clinic בכתב ומראש.
                <br />
                <span className={listNumberStyles}>28 . </span>
                המשתמש מצהיר ומתחייב, כי הוא לא ינקוט בשום פעולה ולא ירשה לבצע
                כל פעולה שעלולה (במישרין ו/או בעקיפין) לחבל בתפעולו התקין והשוטף
                של האתר ו/או עלולה לגרום לשינוי המידע המוצג בו ו/או עלולה לגרום
                לנזקים לSun Clinic ו/או למשתמשים אחרים ו/או צדדים שלישיים כלשהם.
                <br />
                <h4 className="underline font-extrabold my-4">שיפוי</h4>
                <span className={listNumberStyles}>29 . </span>
                המשתמש מתחייב בזאת לשאת במלוא האחריות לכל הפרה של תנאי השימוש
                והוא מתחייב בזאת לשפות את Sun Clinic בגין כל נזק, הפסד,
                אבדן-רווח, תשלום או הוצאה שייגרמו לה, לרבות שכר טרחת עורך דין
                והוצאות משפט בקשר עם הפרת תנאי שימוש אלה.
                <br />
                <h4 className="underline font-extrabold my-4">
                  הפסקת פעילות האתר
                </h4>
                <span className={listNumberStyles}>30 . </span>
                Sun Clinic רשאית לחדול בכל עת מהפעלת האתר בין לתקופה קצובה ובין
                באופן קבוע, ללא הודעה מוקדמת ומבלי לקבל את הסכמת המשתמש לכך.
                <br />
                <h4 className="underline font-extrabold my-4">שונות</h4>
                <span className={listNumberStyles}>31 . </span>
                Sun Clinic תהא רשאית לשנות, מעת לעת את תנאי השימוש באתר וזאת ללא
                הודעה מוקדמת ומבלי לקבל את הסכמת המשתמש. כל שינוי בתנאי השימוש
                יחייב את המשתמשים בתוך 10 ימים מיום פרסומם של תנאי השימוש
                המתוקנים באתר.
                <br />
                <span className={listNumberStyles}>32 . </span>
                המשתמש מסכים, כי בכל סכסוך נשוא הסכם זה לא תהיה תחולה בשום אופן
                לדין זר כלשהו ו/או לכללי ברירת דין בינלאומיים כלשהם, וכי הדין
                החל על הסכם זה יהיה הדין הישראלי בלבד. מקום השיפוט הבלעדי בכל
                מחלוקת שתתגלע בקשר עם האתר, המידע ו/או השימוש בהם יהיה בית המשפט
                המוסמך בתל אביב בלבד.
                <br />
                <span className={listNumberStyles}>33 . </span>
                מובהר ומוסכם, כי Sun Clinic תהא רשאית להמחות, להעביר ו/או להסב
                את כל הזכויות ו/או החובות הכלולות ו/או הנובעות מהסכם זה, באופן
                מלא או חלקי ובכל צורה שהיא לצד ג’ כלשהו, ללא צורך בהודעה מוקדמת
                או בהסכמת המשתמש.
                <br />
                הריני לאשר, כי קראתי והבנתי את תנאי השימוש, אני מסכים להם
                ומתחייב לפעול בהתאם להם, ואני מודע לכך שאחריות Sun Clinic ו/או
                מפעילי האתר ו/או מי מהם ו/או מטעמם כפופה לתנאי השימוש כאמור
                לעיל.
                <br />
              </div> */}
              {isModalOpen === "TermsOfUse" && <TermsOfUse /> }
              {isModalOpen === "accessibility" && <AccessibilityStatement /> }
            </div>
          </div>
        </div>
      )}
    </>
  );
};

export default TermsOfUseModal;
